tap "codecrafters-io/tap"
tap "felixkratz/formulae"
tap "grishka/grishka"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "koekeishiya/formulae"
tap "localsend/localsend"
tap "ngrok/ngrok"
tap "nikitabobko/tap"
brew "xz"
brew "coreutils"
brew "libyaml"
brew "asdf"
brew "bash"
brew "bat"
brew "btop"
brew "python@3.12"
brew "curl"
brew "exercism"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "harfbuzz"
brew "pango"
brew "open-mpi"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "gnu-typist"
brew "gotop"
brew "htop"
brew "hugo"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "libsql"
brew "lsd"
brew "luarocks"
brew "make"
brew "mas"
brew "mise"
brew "moreutils"
brew "mplayer"
brew "mpv"
brew "ncdu"
brew "neovim"
brew "nowplaying-cli"
brew "pastel"
brew "pgcli"
brew "poetry"
brew "poppler"
brew "ranger"
brew "ripgrep"
brew "ruby"
brew "selene"
brew "slides"
brew "tldr"
brew "tmux"
brew "topgrade"
brew "tree"
brew "unzip"
brew "vim"
brew "w3m"
brew "wget"
brew "yarn"
brew "yazi"
brew "yewtube"
brew "zoxide"
brew "zsh"
brew "codecrafters-io/tap/codecrafters"
brew "felixkratz/formulae/borders"
brew "jakehilborn/jakehilborn/displayplacer"
cask "aerospace"
cask "alacritty"
cask "arc"
cask "jordanbaird-ice"
cask "localsend"
cask "ngrok"
cask "qutebrowser"
cask "raycast"
cask "scroll-reverser"
cask "stats"
cask "vlc"
