tap "grishka/grishka"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
brew "xz"
brew "sqlite"
brew "azure-cli"
brew "bash"
brew "bat"
brew "python@3.12"
brew "coreutils"
brew "curl"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "harfbuzz"
brew "pango"
brew "open-mpi"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "gotop"
brew "htop"
brew "hugo"
brew "imagemagick"
brew "lazydocker"
brew "lazygit"
brew "libsql"
brew "libyaml"
brew "lsd"
brew "make"
brew "mise"
brew "moreutils"
brew "mplayer"
brew "mpv"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "tmux"
brew "overmind"
brew "pastel"
brew "pgcli"
brew "poetry"
brew "poppler"
brew "postgresql@14"
brew "ranger"
brew "redis"
brew "ripgrep"
brew "selene"
brew "slides"
brew "superfile"
brew "topgrade"
brew "tree"
brew "unzip"
brew "vim"
brew "vips"
brew "w3m"
brew "wget"
brew "yarn"
brew "yazi"
brew "yewtube"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "jakehilborn/jakehilborn/displayplacer"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "1password-cli"
cask "aerospace"
cask "alacritty"
cask "aptible"
cask "arc"
cask "eqmac"
cask "jordanbaird-ice"
cask "neardrop"
cask "ollama"
cask "qutebrowser"
cask "raycast"
cask "scroll-reverser"
cask "stats"
cask "zoom"
