tap "anomalyco/tap", trusted: true
tap "codecrafters-io/tap", trusted: true
tap "felixkratz/formulae", trusted: true
tap "jakehilborn/jakehilborn", trusted: true
tap "localsend/localsend", trusted: true
tap "nikitabobko/tap", trusted: true
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Command-line tool to interact with exercism.io
brew "exercism"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Powerful, lightweight programming language
brew "lua"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# CLI for Apple's Private (Closed) Mobile Device Framework
brew "mobiledevice"
# Deep clean and optimize your Mac
brew "mole"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Interactive cheatsheet tool for the command-line
brew "navi"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Outputs current CPU temperature for OSX
brew "osx-cpu-temp"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# File browser
brew "ranger"
# Blazing-fast modern Lua linter
brew "selene"
# Terminal based presentation tool
brew "slides"
# Opinionated Lua code formatter
brew "stylua"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Upgrade all the things
brew "topgrade"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Extraction utility for .zip compressed archives
brew "unzip"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# Terminal based YouTube player and downloader
brew "yewtube"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# CodeCrafters CLI
brew "codecrafters-io/tap/codecrafters", trusted: true
# A window border system for macOS
brew "felixkratz/formulae/borders", trusted: true
# macOS command line utility to configure multi-display resolutions and arrangements. Essentially XRandR for macOS.
brew "jakehilborn/jakehilborn/displayplacer", trusted: true
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Terminal interface for Antigravity agents
cask "antigravity-cli"
# Two-factor authentication software
cask "authy"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "font-fira-code-nerd-font"
# Web browser
cask "google-chrome"
# Menu bar manager
cask "jordanbaird-ice"
# Password manager app
cask "keepassxc"
# GPU-based terminal emulator
cask "kitty"
# An open source cross-platform alternative to AirDrop
cask "localsend/localsend/localsend", trusted: true
# Connect to your Android devices
cask "macdroid"
# Control your tools with a few keystrokes
cask "raycast"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# System monitor for the menu bar
cask "stats"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
mas "iMovie", id: 408981434
mas "Xcode", id: 497799835
